ИС_СПОРТ_2022/src/InformationRegisters/СборныеСпортсменов/СборныеСпортсменов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СборныеСпортсменов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ВключитьВСборную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сборная</name>
    <type>
      <types>CatalogRef.Сборные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/InformationRegisters/СборныеСпортсменов/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

// {Рарус adilas #10373 -Сборные спортсмена 2020.10.23
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если  Параметры.ЗначенияЗаполнения.Свойство("Спортсмен", ЗначениеЗаполнено("Спортсмен")) И Запись.Спортсмен.Пустая() Тогда
		Запись.Спортсмен = Параметры.ЗначенияЗаполнения.Спортсмен;
		УчетСпортсменовСервер.ЗаполнитьНастройкиПоУмолчанию(Запись);
	ИначеЕсли Параметры.ЗначенияЗаполнения.Свойство("Спортсмен", Не ЗначениеЗаполнено("Спортсмен")) И Запись.Спортсмен.Пустая() Тогда
		УчетСпортсменовСервер.ЗаполнитьНастройкиПоУмолчанию(Запись);		
	Иначе
		Возврат;
	КонецЕсли;
КонецПроцедуры

// }Рарус adilas #10373 -Сборные спортсмена 2020.10.23

// {Рарус adilas #15411 -Тестирование Релиза Альфа Спорт 1.0.0.1. Сборные 2021.04.08
//
&НаКлиенте
Процедура СборнаяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Запись.Организация);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ОбработчикОповещениеПослеЗакрытия = Новый ОписаниеОповещения("ПослеЗакрытияФормыСборная", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Сборные.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработчикОповещениеПослеЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыСборная(Результат, ДополнительныеПараметры) Экспорт

	Запись.Сборная = Результат;	
	
КонецПроцедуры

// }Рарус adilas #15411 -Тестирование Релиза Альфа Спорт 1.0.0.1. Сборные 2021.04.08

#КонецОбласти
